In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
salaries = pd.read_csv("higher_ed_employee_salaries.csv")

In [4]:
salaries.head()

,Name,School,Job Description,Department,Earnings,Year
0,Don Potter,University of Akron,Assistant Lecturer,Social Work,2472.00,2019
1,Emily Potter,The Ohio State University,Administrative Assistant 3,Arts and Sciences | Chemistry and Biochemistry...,48538.02,2022
2,Carol Jean Potter,The Ohio State University,Associate Professor-Clinical,Pediatrics,22722.80,2013
3,Kim Potter,The Ohio State University,"Manager 4, Compliance",Legal Affairs | Compliance,170143.44,2022
4,Graham Potter,Miami University,Building and Grounds Assistant,"Assoc VP Housing,Dining,Rec,Bus Svc",3075.20,2012

In [9]:
salaries.isna()

         Name  School  Job Description  Department  Earnings   Year
0       False   False            False       False     False  False
1       False   False            False       False     False  False
2       False   False            False       False     False  False
3       False   False            False       False     False  False
4       False   False            False       False     False  False
...       ...     ...              ...         ...       ...    ...
934343  False   False            False       False     False  False
934344  False   False            False       False     False  False
934345  False   False            False       False     False  False
934346  False   False            False       False     False  False
934347  False   False            False       False     False  False

[934348 rows x 6 columns]

In [10]:
missing_values = salaries.isnull().sum()
print(missing_values)

Name                   0
School                 0
Job Description    26668
Department         60452
Earnings            9675
Year                   0
dtype: int64

In [20]:
unique_schools = salaries['School'].unique()
print(unique_schools)

['University of Akron' 'The Ohio State University' 'Miami University'
 'Bowling Green State University' 'Central State University'
 'Ohio University' 'Youngstown State University' 'Kent State University'
 'University Of Cincinnati' 'Wright State University'
 'University of Toledo' 'Shawnee State University'
 'Cleveland State University']

In [22]:
unique_schools = salaries['Job Description'].nunique()
print(unique_schools)

38679

In [18]:
unique_schools = salaries['Department'].unique()
print(unique_schools)

['Social Work'
 'Arts and Sciences | Chemistry and Biochemistry Administration'
 'Pediatrics' ... 'CH BSAM BACH APPL MGT' 'Ch Applied Management'
 'Ch Bsam Bach Appl Mgt']

In [14]:
unique_schools = salaries['Year'].unique()
print(unique_schools)

[2019 2022 2013 2012 2015 2018 2021 2014 2020 2016 2017 2011]